
export type Category = {
  name:
    | 'पशुधन'
    | 'शेती उत्पादने'
    | 'शेतीसाठी साधनं'
    | 'शेती व गाव सेवा'
    | 'गावातील गरज'
    | 'व्यावसायिक सेवा'
    | 'आर्थिक';
  subcategories: string[];
};

export const categories: Category[] = [
  {
    name: 'पशुधन',
    subcategories: ['गाय', 'बैल', 'म्हैस', 'शेळी', 'मेंढी', 'कुक्कुटपालन'],
  },
  {
    name: 'शेती उत्पादने',
    subcategories: ['कांदा', 'कापूस', 'धान्य', 'भाजीपाला', 'फळे'],
  },
  {
    name: 'शेतीसाठी साधनं',
    subcategories: ['ट्रॅक्टर', 'अवजारं', 'सिंचन साहित्य', 'हार्वेस्टर'],
  },
  {
    name: 'शेती व गाव सेवा',
    subcategories: ['वाहतूक', 'ड्रोन स्प्रे', 'कंत्राटी शेती', 'पशुवैद्यक'],
  },
  {
    name: 'गावातील गरज',
    subcategories: ['बांधकाम साहित्य', 'सेकंड हँड वाहनं', 'खाद्यपदार्थ'],
  },
  {
    name: 'व्यावसायिक सेवा',
    subcategories: [
      'प्लंबर',
      'इलेक्ट्रिशियन',
      'सुतार',
      'मिस्त्री',
      'मेकॅनिक',
      'DJ/टेंट',
      'टॅक्सी',
    ],
  },
  { name: 'आर्थिक', subcategories: ['उधारी/इनव्हॉईस', 'बचत संस्था', 'सरकारी योजना'] },
];
